#define _CRT_SECURE_NO_WARNINGS 1
#include <iostream>
using namespace std;

int main050301()
{
	//方式1：
	//数组类型 数组名称[行数][列数];

	int arr[2][3];

	//二维数组的访问：
	arr[0][0] = 1;
	arr[0][1] = 2;
	arr[0][2] = 3;
	arr[1][0] = 4;
	arr[1][1] = 5;
	arr[1][2] = 6;

	int i, j;
	for (i = 0; i < 2; i++)
	{
		for (j = 0; j < 3; j++)
		{
			cout << "arr[" << i << "][" << j << "]=" << arr[i][j] << " ";
		}
		cout << endl;
	}

	//方式2：
	//数据类型 数组名称[行数][列数]={{},{}}；
	int arr2[2][3] = { {1,2,3},{4,5,6} };
	int arr3[2][3] =
	{
		{1,2,3},
		{4,5,6}
	};

	//方式3：
	//数据类型 数组名称[行数][列数]={...}；
	int arr4[2][3] = { 1,2,3,4,5,6 };
		
	//方式4：
	//数据类型 数组名称[][列数]={...}；
	int arr5[][3] = { 1,2,3,4,5,6 };

	return 0;
}